# У цьому прикладі працюю зі змінними, різними типами даних, операторами, вбудованими функціями та колекціями.

# Враховуючи, що мені необхідно зрозуміти роботу github, я неодноразово вивантажуватиму коміти, навіть при невеликих змінах.
# Програма має введення, обробку та висновок, чому б не зробити першу програму? Я звичайно ще не можу використовувати if, але що-небудь придумаю
# І так поїхали!

# Введення (отримання даних)
ім_я = input("Введіть ваше ім'я: ")

# Перетворення (обробка даних)
вітання = f"Привіт, {ім_я}!"

# Виведення (виведення даних)
print(вітання)

# На цьому етапі я був шокований тим, що змінна може бути не обов'язково англійськоб мовою.

# Зарезервовані слова в Python: False, None, True, and, as, assert, async, await, break, class, continue, def, del,
# elif, else, except, finally, for, from, global, if, import, in, is, lambda, nonlocal, not, or, pass, raise, return,
# try, while, with, yield

# int - цілі числа 47, 5, 0, -666
# float - дійсні числа 3.14, 0.001, 2.0

box = 'Asscold'